iostat -x -c -d 5 -m

下面是执行的结果，每隔5秒显示一次，我想实现将里面的指标用中文简要翻译下，只作为脚本，通过执行脚本来代替上面的命令，实现对系统的监控结果中文化展示。
请帮助我实现下这个需求

avg-cpu:  %user   %nice %system %iowait  %steal   %idle
          20.39    0.00   10.62    0.18    0.00   68.81

Device:         rrqm/s   wrqm/s     r/s     w/s    rMB/s    wMB/s avgrq-sz avgqu-sz   await r_await w_await  svctm  %util
sda               0.00     0.00    0.00 1528.00     0.00   105.80   141.80     1.02    0.67    0.00    0.67   0.45  69.23
dm-0              0.00     0.00    0.00    1.33     0.00     0.01     8.00     0.04   28.00    0.00   28.00  28.00   3.73
dm-1              0.00     0.00    0.00    0.00     0.00     0.00     0.00     0.00    0.00    0.00    0.00   0.00   0.00
dm-2              0.00     0.00    0.00    0.00     0.00     0.00     0.00     0.00    0.00    0.00    0.00   0.00   0.00
dm-3              0.00     0.00    0.00 1527.00     0.00   105.80   141.90     0.98    0.64    0.00    0.64   0.44  66.70